is1200-example-projects/mcb32tools/headers/proc/p32mz1024ecg124.h
#define _ODCJ_ODCJ11_POSITION                    0x0000000B
#define _ODCJ_ODCJ11_MASK                        0x00000800
#define _ODCJ_ODCJ11_LENGTH                      0x00000001

#define _ODCJ_w_POSITION                         0x00000000
#define _ODCJ_w_MASK                             0xFFFFFFFF
#define _ODCJ_w_LENGTH                           0x00000020

#define _CNPUJ_CNPUJ0_POSITION                   0x00000000
#define _CNPUJ_CNPUJ0_MASK                       0x00000001
#define _CNPUJ_CNPUJ0_LENGTH                     0x00000001

#define _CNPUJ_CNPUJ1_POSITION                   0x00000001
#define _CNPUJ_CNPUJ1_MASK                       0x00000002
#define _CNPUJ_CNPUJ1_LENGTH                     0x00000001

#define _CNPUJ_CNPUJ2_POSITION                   0x00000002
#define _CNPUJ_CNPUJ2_MASK                       0x00000004
#define _CNPUJ_CNPUJ2_LENGTH                     0x00000001

#define _CNPUJ_CNPUJ4_POSITION                   0x00000004
#define _CNPUJ_CNPUJ4_MASK                       0x00000010
#define _CNPUJ_CNPUJ4_LENGTH                     0x00000001

#define _CNPUJ_CNPUJ8_POSITION                   0x00000008
#define _CNPUJ_CNPUJ8_MASK                       0x00000100
#define _CNPUJ_CNPUJ8_LENGTH                     0x00000001

#define _CNPUJ_CNPUJ9_POSITION                   0x00000009
#define _CNPUJ_CNPUJ9_MASK                       0x00000200
#define _CNPUJ_CNPUJ9_LENGTH                     0x00000001

#define _CNPUJ_CNPUJ11_POSITION                  0x0000000B
#define _CNPUJ_CNPUJ11_MASK                      0x00000800
#define _CNPUJ_CNPUJ11_LENGTH                    0x00000001

#define _CNPUJ_w_POSITION                        0x00000000
#define _CNPUJ_w_MASK                            0xFFFFFFFF
#define _CNPUJ_w_LENGTH                          0x00000020

#define _CNPDJ_CNPDJ0_POSITION                   0x00000000
#define _CNPDJ_CNPDJ0_MASK                       0x00000001
#define _CNPDJ_CNPDJ0_LENGTH                     0x00000001

#define _CNPDJ_CNPDJ1_POSITION                   0x00000001
#define _CNPDJ_CNPDJ1_MASK                       0x00000002
#define _CNPDJ_CNPDJ1_LENGTH                     0x00000001

#define _CNPDJ_CNPDJ2_POSITION                   0x00000002
#define _CNPDJ_CNPDJ2_MASK                       0x00000004
#define _CNPDJ_CNPDJ2_LENGTH                     0x00000001

#define _CNPDJ_CNPDJ4_POSITION                   0x00000004
#define _CNPDJ_CNPDJ4_MASK                       0x00000010
#define _CNPDJ_CNPDJ4_LENGTH                     0x00000001

#define _CNPDJ_CNPDJ8_POSITION                   0x00000008
#define _CNPDJ_CNPDJ8_MASK                       0x00000100
#define _CNPDJ_CNPDJ8_LENGTH                     0x00000001

#define _CNPDJ_CNPDJ9_POSITION                   0x00000009
#define _CNPDJ_CNPDJ9_MASK                       0x00000200
#define _CNPDJ_CNPDJ9_LENGTH                     0x00000001

#define _CNPDJ_CNPDJ11_POSITION                  0x0000000B
#define _CNPDJ_CNPDJ11_MASK                      0x00000800
#define _CNPDJ_CNPDJ11_LENGTH                    0x00000001

#define _CNPDJ_w_POSITION                        0x00000000
#define _CNPDJ_w_MASK                            0xFFFFFFFF
#define _CNPDJ_w_LENGTH                          0x00000020

#define _CNCONJ_SIDL_POSITION                    0x0000000D
#define _CNCONJ_SIDL_MASK                        0x00002000
#define _CNCONJ_SIDL_LENGTH                      0x00000001

#define _CNCONJ_ON_POSITION                      0x0000000F
#define _CNCONJ_ON_MASK                          0x00008000
#define _CNCONJ_ON_LENGTH                        0x00000001

#define _CNCONJ_w_POSITION                       0x00000000
#define _CNCONJ_w_MASK                           0xFFFFFFFF
#define _CNCONJ_w_LENGTH                         0x00000020

#define _CNENJ_CNIEJ0_POSITION                   0x00000000
#define _CNENJ_CNIEJ0_MASK                       0x00000001
#define _CNENJ_CNIEJ0_LENGTH                     0x00000001

#define _CNENJ_CNIEJ1_POSITION                   0x00000001
#define _CNENJ_CNIEJ1_MASK                       0x00000002
#define _CNENJ_CNIEJ1_LENGTH                     0x00000001

#define _CNENJ_CNIEJ2_POSITION                   0x00000002
#define _CNENJ_CNIEJ2_MASK                       0x00000004
#define _CNENJ_CNIEJ2_LENGTH                     0x00000001

#define _CNENJ_CNIEJ4_POSITION                   0x00000004
#define _CNENJ_CNIEJ4_MASK                       0x00000010
#define _CNENJ_CNIEJ4_LENGTH                     0x00000001

#define _CNENJ_CNIEJ8_POSITION                   0x00000008
#define _CNENJ_CNIEJ8_MASK                       0x00000100
#define _CNENJ_CNIEJ8_LENGTH                     0x00000001

#define _CNENJ_CNIEJ9_POSITION                   0x00000009
#define _CNENJ_CNIEJ9_MASK                       0x00000200
#define _CNENJ_CNIEJ9_LENGTH                     0x00000001

#define _CNENJ_CNIEJ11_POSITION                  0x0000000B
#define _CNENJ_CNIEJ11_MASK                      0x00000800
#define _CNENJ_CNIEJ11_LENGTH                    0x00000001

#define _CNENJ_w_POSITION                        0x00000000
#define _CNENJ_w_MASK                            0xFFFFFFFF
#define _CNENJ_w_LENGTH                          0x00000020

#define _CNSTATJ_CNSTATJ0_POSITION               0x00000000
#define _CNSTATJ_CNSTATJ0_MASK                   0x00000001
#define _CNSTATJ_CNSTATJ0_LENGTH                 0x00000001

#define _CNSTATJ_CNSTATJ1_POSITION               0x00000001
#define _CNSTATJ_CNSTATJ1_MASK                   0x00000002
#define _CNSTATJ_CNSTATJ1_LENGTH                 0x00000001

#define _CNSTATJ_CNSTATJ2_POSITION               0x00000002
#define _CNSTATJ_CNSTATJ2_MASK                   0x00000004
#define _CNSTATJ_CNSTATJ2_LENGTH                 0x00000001

#define _CNSTATJ_CNSTATJ4_POSITION               0x00000004
#define _CNSTATJ_CNSTATJ4_MASK                   0x00000010
#define _CNSTATJ_CNSTATJ4_LENGTH                 0x00000001

#define _CNSTATJ_CNSTATJ8_POSITION               0x00000008
#define _CNSTATJ_CNSTATJ8_MASK                   0x00000100
#define _CNSTATJ_CNSTATJ8_LENGTH                 0x00000001

#define _CNSTATJ_CNSTATJ9_POSITION               0x00000009
#define _CNSTATJ_CNSTATJ9_MASK                   0x00000200
#define _CNSTATJ_CNSTATJ9_LENGTH                 0x00000001

