is1200-example-projects/mcb32tools/headers/proc/p32mz1024ecg124.h
#define _SQI1THR_THRES_POSITION                  0x00000000
#define _SQI1THR_THRES_MASK                      0x0000007F
#define _SQI1THR_THRES_LENGTH                    0x00000007

#define _SQI1INTSEN_TXEMPTYISE_POSITION          0x00000000
#define _SQI1INTSEN_TXEMPTYISE_MASK              0x00000001
#define _SQI1INTSEN_TXEMPTYISE_LENGTH            0x00000001

#define _SQI1INTSEN_TXFULLISE_POSITION           0x00000001
#define _SQI1INTSEN_TXFULLISE_MASK               0x00000002
#define _SQI1INTSEN_TXFULLISE_LENGTH             0x00000001

#define _SQI1INTSEN_TXTHRISE_POSITION            0x00000002
#define _SQI1INTSEN_TXTHRISE_MASK                0x00000004
#define _SQI1INTSEN_TXTHRISE_LENGTH              0x00000001

#define _SQI1INTSEN_RXEMPTYISE_POSITION          0x00000003
#define _SQI1INTSEN_RXEMPTYISE_MASK              0x00000008
#define _SQI1INTSEN_RXEMPTYISE_LENGTH            0x00000001

#define _SQI1INTSEN_RXFULLISE_POSITION           0x00000004
#define _SQI1INTSEN_RXFULLISE_MASK               0x00000010
#define _SQI1INTSEN_RXFULLISE_LENGTH             0x00000001

#define _SQI1INTSEN_RXTHRISE_POSITION            0x00000005
#define _SQI1INTSEN_RXTHRISE_MASK                0x00000020
#define _SQI1INTSEN_RXTHRISE_LENGTH              0x00000001

#define _SQI1INTSEN_CONFULLISE_POSITION          0x00000006
#define _SQI1INTSEN_CONFULLISE_MASK              0x00000040
#define _SQI1INTSEN_CONFULLISE_LENGTH            0x00000001

#define _SQI1INTSEN_CONEMPTYISE_POSITION         0x00000007
#define _SQI1INTSEN_CONEMPTYISE_MASK             0x00000080
#define _SQI1INTSEN_CONEMPTYISE_LENGTH           0x00000001

#define _SQI1INTSEN_CONTHRISE_POSITION           0x00000008
#define _SQI1INTSEN_CONTHRISE_MASK               0x00000100
#define _SQI1INTSEN_CONTHRISE_LENGTH             0x00000001

#define _SQI1INTSEN_BDDONEISE_POSITION           0x00000009
#define _SQI1INTSEN_BDDONEISE_MASK               0x00000200
#define _SQI1INTSEN_BDDONEISE_LENGTH             0x00000001

#define _SQI1INTSEN_PKTCOMPISE_POSITION          0x0000000A
#define _SQI1INTSEN_PKTCOMPISE_MASK              0x00000400
#define _SQI1INTSEN_PKTCOMPISE_LENGTH            0x00000001

#define _USBCSR0_FUNC_POSITION                   0x00000000
#define _USBCSR0_FUNC_MASK                       0x0000007F
#define _USBCSR0_FUNC_LENGTH                     0x00000007

#define _USBCSR0_SUSPEN_POSITION                 0x00000008
#define _USBCSR0_SUSPEN_MASK                     0x00000100
#define _USBCSR0_SUSPEN_LENGTH                   0x00000001

#define _USBCSR0_SUSPMODE_POSITION               0x00000009
#define _USBCSR0_SUSPMODE_MASK                   0x00000200
#define _USBCSR0_SUSPMODE_LENGTH                 0x00000001

#define _USBCSR0_RESUME_POSITION                 0x0000000A
#define _USBCSR0_RESUME_MASK                     0x00000400
#define _USBCSR0_RESUME_LENGTH                   0x00000001

#define _USBCSR0_RESET_POSITION                  0x0000000B
#define _USBCSR0_RESET_MASK                      0x00000800
#define _USBCSR0_RESET_LENGTH                    0x00000001

#define _USBCSR0_HSMODE_POSITION                 0x0000000C
#define _USBCSR0_HSMODE_MASK                     0x00001000
#define _USBCSR0_HSMODE_LENGTH                   0x00000001

#define _USBCSR0_HSEN_POSITION                   0x0000000D
#define _USBCSR0_HSEN_MASK                       0x00002000
#define _USBCSR0_HSEN_LENGTH                     0x00000001

#define _USBCSR0_SOFTCONN_POSITION               0x0000000E
#define _USBCSR0_SOFTCONN_MASK                   0x00004000
#define _USBCSR0_SOFTCONN_LENGTH                 0x00000001

#define _USBCSR0_ISOUPD_POSITION                 0x0000000F
#define _USBCSR0_ISOUPD_MASK                     0x00008000
#define _USBCSR0_ISOUPD_LENGTH                   0x00000001

#define _USBCSR0_EP0IF_POSITION                  0x00000010
#define _USBCSR0_EP0IF_MASK                      0x00010000
#define _USBCSR0_EP0IF_LENGTH                    0x00000001

#define _USBCSR0_EP1TXIF_POSITION                0x00000011
#define _USBCSR0_EP1TXIF_MASK                    0x00020000
#define _USBCSR0_EP1TXIF_LENGTH                  0x00000001

#define _USBCSR0_EP2TXIF_POSITION                0x00000012
#define _USBCSR0_EP2TXIF_MASK                    0x00040000
#define _USBCSR0_EP2TXIF_LENGTH                  0x00000001

#define _USBCSR0_EP3TXIF_POSITION                0x00000013
#define _USBCSR0_EP3TXIF_MASK                    0x00080000
#define _USBCSR0_EP3TXIF_LENGTH                  0x00000001

#define _USBCSR0_EP4TXIF_POSITION                0x00000014
#define _USBCSR0_EP4TXIF_MASK                    0x00100000
#define _USBCSR0_EP4TXIF_LENGTH                  0x00000001

#define _USBCSR0_EP5TXIF_POSITION                0x00000015
#define _USBCSR0_EP5TXIF_MASK                    0x00200000
#define _USBCSR0_EP5TXIF_LENGTH                  0x00000001

#define _USBCSR0_EP6TXIF_POSITION                0x00000016
#define _USBCSR0_EP6TXIF_MASK                    0x00400000
#define _USBCSR0_EP6TXIF_LENGTH                  0x00000001

#define _USBCSR0_EP7TXIF_POSITION                0x00000017
#define _USBCSR0_EP7TXIF_MASK                    0x00800000
#define _USBCSR0_EP7TXIF_LENGTH                  0x00000001

#define _USBCSR1_EP1RXIF_POSITION                0x00000001
#define _USBCSR1_EP1RXIF_MASK                    0x00000002
#define _USBCSR1_EP1RXIF_LENGTH                  0x00000001

#define _USBCSR1_EP2RXIF_POSITION                0x00000002
#define _USBCSR1_EP2RXIF_MASK                    0x00000004
#define _USBCSR1_EP2RXIF_LENGTH                  0x00000001

#define _USBCSR1_EP3RXIF_POSITION                0x00000003
#define _USBCSR1_EP3RXIF_MASK                    0x00000008
#define _USBCSR1_EP3RXIF_LENGTH                  0x00000001

#define _USBCSR1_EP4RXIF_POSITION                0x00000004
#define _USBCSR1_EP4RXIF_MASK                    0x00000010
#define _USBCSR1_EP4RXIF_LENGTH                  0x00000001

#define _USBCSR1_EP5RXIF_POSITION                0x00000005
#define _USBCSR1_EP5RXIF_MASK                    0x00000020
#define _USBCSR1_EP5RXIF_LENGTH                  0x00000001

